{"tags":[],"categories":[{"name":"杂谈","permalink":"https://joesteven.github.io/categories/杂谈/","url":"/async/categories/杂谈.json","count":1}],"url":"/async/posts/do_what_ever_u_want.json","date":1472135642000,"path":{"year":2016,"month":8,"day":25,"name":"do_what_ever_u_want"},"title":"我和自己","permalink":"https://joesteven.github.io/do_what_ever_u_want/","content":"<blockquote>\n<p>在海淀黄庄的天桥上，看来去的车流，也能望到新浪的大楼，那一刻的我忽然百感交集。</p>\n</blockquote>\n<p>毕业一年，疲于奔命的一年让我很久很久没有像在大学时那样，每周去民主湖发呆，与自己对话。</p>\n<p>来北京也快半年了，在明天搬家前，我想我终于可以再一次与自己对话，今晚做一个不再转动的齿轮。</p>\n<h3 id=\"夜半\"><a href=\"#夜半\" class=\"headerlink\" title=\"夜半\"></a>夜半</h3><p><strong>困倦和摸不到的光让你时刻都想放弃</strong></p>\n<p>大四的开头，一切都充满着希望，我也充满着斗志，而黑暗来得那么迅速，让我来不及思考，来不及准备，甚至来不及面对。我一直以来所相信的那些价值观，我的信仰和希望，在那时候顷刻崩塌，无尽的自责和内疚充满了我每一个细胞，清醒着的时间也让我觉得那么的漫长和折磨。陪伴着我的人，也不断得被我推开推远。</p>\n<p>我变得不再爱说话，害怕与人沟通，在那些日子里，纠结，折磨，困惑，抑郁。</p>\n<p>而我偏偏又干上了销售，这就是命运吧。</p>\n<p>我依然清晰的记得那些梦，记得我哭着抱着姐姐不让她走，也记得姐姐笑着说她已经走了。我也许该庆幸，此刻还能敲出这些冰冷的文字，因为至少，我还要去替她看看这个世界。</p>\n<p><strong>2014.10.2 姐姐永远是我这边最美的月亮</strong></p>\n<h3 id=\"鸡鸣\"><a href=\"#鸡鸣\" class=\"headerlink\" title=\"鸡鸣\"></a>鸡鸣</h3><p><strong>鸡鸣的时候，预示着天就要亮了，而这等待中的黑暗却无比的漫长</strong></p>\n<p>到现在依然会有很多人问我，诶，你为什么要放弃那样一份工作呢？</p>\n<p>14 年的十一月，我坐上去成都的动车，参加一场毫无概念的面试，也是我大四开始找工作以来最困难的一次面试。时间持续了整整一天，回到学校后不闻不问，依然放纵自己。我还记得那天下午 Ellie 给我打电话发 offer 的时候我平静得要命，只是简单的哦了几声，Ellie 当时就说小朋友你太淡定了吧。</p>\n<p>这是一件值得开心的事情，尤其是在我那种状态下，彷佛可以松了一口气，十一月到第二年的三月，除了一月和花儿去了一趟云南，在冰天雪地里释放所有的不安，此外什么都没干。</p>\n<p>当我以为我准备好了，可以很好的掌控自己的时候，才发现我错了，从四月到十月，每一天都让我越发的压抑，当我从口若悬河到面对同事，客户，一个字都憋不出来的时候，我知道我已经废了。而偏偏和我一起进入公司的管培生是那么的会来事儿。</p>\n<p>还没毕业的时候，爸爸打电话跟我说“不要随波逐流，顺从你自己，做有意义的事情”。可那时候的我啊，并不知道什么对我来说是有意义的事情。</p>\n<h3 id=\"破晓\"><a href=\"#破晓\" class=\"headerlink\" title=\"破晓\"></a>破晓</h3><p><strong>当能看到一点光的时候，说明一切开始往好的方向发展了</strong></p>\n<p>好朋友的女朋友是学计算机的，那时候好朋友劝我说，你去报个培训班吧，培训出来就能有一万多的工资。我第一反应是算了，我？程序员？</p>\n<p>表面上说着不要，身体却很诚实，在网上找了几个教程，自己学着搭了一搭 Java 的开发环境，摸着瞎就学了起来。从环境搭起来的那一天，一切都开始朝着不可控制的方向飞快的发展起来。我被写代码这件事情深深的吸引住了:</p>\n<ul>\n<li><strong>好像我又具备了沟通的能力，只不过对象不是人</strong></li>\n<li><strong>代码诚不欺我</strong></li>\n<li><strong>沟通成本远低于人</strong></li>\n</ul>\n<p>可我能成为一个程序员吗？我自己问自己，我的朋友也问我，当我的父母知道之后也这样问我。只有一个人没有问过我，她只说了一句话：如果你已经决定了，那么你一定会成为一个优秀的程序员。</p>\n<p>这个人就是我女朋友。三个月内，我比人生中任何一个阶段都努力，远远超过了高考前的准备。我疯狂的成长，又从这种成长中获取到成吨的快乐和成就感。也是在那三个月内，我有幸认识了猴子，认识了阿语，认识了一堆志同道合的朋友和前辈。</p>\n<p>当我觉得我准备好了的时候，也是她跟我说，去北京，去对你最好的地方。三天时间北上，将 offer 斩落马下。</p>\n<h3 id=\"清晨\"><a href=\"#清晨\" class=\"headerlink\" title=\"清晨\"></a>清晨</h3><p><strong>阳光将洒落到你身上，你也要准备好迎接正午</strong></p>\n<p>有个朋友笑我，河北通州，你都不算真正的北漂。</p>\n<p>每天在高碑店上班，在土桥睡觉。八通线的终点站，起码每天早上能有座位。刚进公司的那一个月，我发现成长的速度慢了很多，每天做着做不完的重复性的工作，好像他们也不关心你还会不会别的什么。当我意识到的时候，每天即便是十一点到家，也逼着自己学习新的东西，动手写代码来实践。</p>\n<p>很巧，有一个老司机大概也是机缘巧合来到这个公司 — 鹏哥。为什么说机缘巧合，因为他来的时候并不知道是上 6 天，因为上 6 天班，他已经拒了上一家公司。鹏哥是一个很讲究的人，不敷衍，热爱技术。在这个并没有太多技术氛围的公司里面，我们很快熟络起来。</p>\n<p>在跟鹏哥的长期交流和自己连续性的学习下，我发现自己的成长速度开始回升，甚至超过了开始那三个月。和最初认识的老司机们也搞了点大新闻 — itsCoder。</p>\n<p>因为 itsCoder 上第一期文章，被今日头条的人找到。在经历了长达四个多小时的面试，从一开始的被轻视到最后给他们带来的惊喜，我想我已经做到了。</p>\n<h3 id=\"今天\"><a href=\"#今天\" class=\"headerlink\" title=\"今天\"></a>今天</h3><p>现在是 2016 年 8 月 25 日 11 点 52 分，明天我就要离开通州土桥了。</p>\n<h3 id=\"未来\"><a href=\"#未来\" class=\"headerlink\" title=\"未来\"></a>未来</h3><p>我不知道未来还会发生什么，也不知道我需要面对什么，但是我知道：</p>\n<p><strong>不管未来等待我的是什么，我都会从容的面对。</strong></p>\n<p>盗用鹏哥一句话：<strong>一切都是上天最好的安排。</strong></p>\n"}